###################################################################

# Created by write_sdc on Mon Aug 27 10:58:45 2018

###################################################################
set sdc_version 2.0

set_units -time ns -resistance MOhm -capacitance fF -voltage V -current mA
set_wire_load_model -name 5K_hvratio_1_1 -library NangateOpenCellLibrary
create_clock -name i_Clk  -period 4  -waveform {0 2}
set_clock_uncertainty 0.004  [get_clocks i_Clk]
set_input_delay -clock i_Clk  0  [get_ports i_clk]
set_input_delay -clock i_Clk  0  [get_ports i_lfsr_en]
set_input_delay -clock i_Clk  0  [get_ports i_Seed_DV]
set_input_delay -clock i_Clk  0  [get_ports {i_Seed_Data[7]}]
set_input_delay -clock i_Clk  0  [get_ports {i_Seed_Data[6]}]
set_input_delay -clock i_Clk  0  [get_ports {i_Seed_Data[5]}]
set_input_delay -clock i_Clk  0  [get_ports {i_Seed_Data[4]}]
set_input_delay -clock i_Clk  0  [get_ports {i_Seed_Data[3]}]
set_input_delay -clock i_Clk  0  [get_ports {i_Seed_Data[2]}]
set_input_delay -clock i_Clk  0  [get_ports {i_Seed_Data[1]}]
set_input_delay -clock i_Clk  0  [get_ports {i_Seed_Data[0]}]
set_input_delay -clock i_Clk  0  [get_ports {i_leak_weight[7]}]
set_input_delay -clock i_Clk  0  [get_ports {i_leak_weight[6]}]
set_input_delay -clock i_Clk  0  [get_ports {i_leak_weight[5]}]
set_input_delay -clock i_Clk  0  [get_ports {i_leak_weight[4]}]
set_input_delay -clock i_Clk  0  [get_ports {i_leak_weight[3]}]
set_input_delay -clock i_Clk  0  [get_ports {i_leak_weight[2]}]
set_input_delay -clock i_Clk  0  [get_ports {i_leak_weight[1]}]
set_input_delay -clock i_Clk  0  [get_ports {i_leak_weight[0]}]
set_input_delay -clock i_Clk  0  [get_ports i_leak_mode_sel]
set_input_delay -clock i_Clk  0  [get_ports {i_syn_weight[31]}]
set_input_delay -clock i_Clk  0  [get_ports {i_syn_weight[30]}]
set_input_delay -clock i_Clk  0  [get_ports {i_syn_weight[29]}]
set_input_delay -clock i_Clk  0  [get_ports {i_syn_weight[28]}]
set_input_delay -clock i_Clk  0  [get_ports {i_syn_weight[27]}]
set_input_delay -clock i_Clk  0  [get_ports {i_syn_weight[26]}]
set_input_delay -clock i_Clk  0  [get_ports {i_syn_weight[25]}]
set_input_delay -clock i_Clk  0  [get_ports {i_syn_weight[24]}]
set_input_delay -clock i_Clk  0  [get_ports {i_syn_weight[23]}]
set_input_delay -clock i_Clk  0  [get_ports {i_syn_weight[22]}]
set_input_delay -clock i_Clk  0  [get_ports {i_syn_weight[21]}]
set_input_delay -clock i_Clk  0  [get_ports {i_syn_weight[20]}]
set_input_delay -clock i_Clk  0  [get_ports {i_syn_weight[19]}]
set_input_delay -clock i_Clk  0  [get_ports {i_syn_weight[18]}]
set_input_delay -clock i_Clk  0  [get_ports {i_syn_weight[17]}]
set_input_delay -clock i_Clk  0  [get_ports {i_syn_weight[16]}]
set_input_delay -clock i_Clk  0  [get_ports {i_syn_weight[15]}]
set_input_delay -clock i_Clk  0  [get_ports {i_syn_weight[14]}]
set_input_delay -clock i_Clk  0  [get_ports {i_syn_weight[13]}]
set_input_delay -clock i_Clk  0  [get_ports {i_syn_weight[12]}]
set_input_delay -clock i_Clk  0  [get_ports {i_syn_weight[11]}]
set_input_delay -clock i_Clk  0  [get_ports {i_syn_weight[10]}]
set_input_delay -clock i_Clk  0  [get_ports {i_syn_weight[9]}]
set_input_delay -clock i_Clk  0  [get_ports {i_syn_weight[8]}]
set_input_delay -clock i_Clk  0  [get_ports {i_syn_weight[7]}]
set_input_delay -clock i_Clk  0  [get_ports {i_syn_weight[6]}]
set_input_delay -clock i_Clk  0  [get_ports {i_syn_weight[5]}]
set_input_delay -clock i_Clk  0  [get_ports {i_syn_weight[4]}]
set_input_delay -clock i_Clk  0  [get_ports {i_syn_weight[3]}]
set_input_delay -clock i_Clk  0  [get_ports {i_syn_weight[2]}]
set_input_delay -clock i_Clk  0  [get_ports {i_syn_weight[1]}]
set_input_delay -clock i_Clk  0  [get_ports {i_syn_weight[0]}]
set_input_delay -clock i_Clk  0  [get_ports {i_G[1]}]
set_input_delay -clock i_Clk  0  [get_ports {i_G[0]}]
set_input_delay -clock i_Clk  0  [get_ports i_syn_mode_sel]
set_input_delay -clock i_Clk  0  [get_ports i_leak_reversal_mode]
set_input_delay -clock i_Clk  0  [get_ports i_spike_en]
set_input_delay -clock i_Clk  0  [get_ports i_leak_en]
set_input_delay -clock i_Clk  0  [get_ports {i_V[7]}]
set_input_delay -clock i_Clk  0  [get_ports {i_V[6]}]
set_input_delay -clock i_Clk  0  [get_ports {i_V[5]}]
set_input_delay -clock i_Clk  0  [get_ports {i_V[4]}]
set_input_delay -clock i_Clk  0  [get_ports {i_V[3]}]
set_input_delay -clock i_Clk  0  [get_ports {i_V[2]}]
set_input_delay -clock i_Clk  0  [get_ports {i_V[1]}]
set_input_delay -clock i_Clk  0  [get_ports {i_V[0]}]
set_input_delay -clock i_Clk  0  [get_ports {i_M[7]}]
set_input_delay -clock i_Clk  0  [get_ports {i_M[6]}]
set_input_delay -clock i_Clk  0  [get_ports {i_M[5]}]
set_input_delay -clock i_Clk  0  [get_ports {i_M[4]}]
set_input_delay -clock i_Clk  0  [get_ports {i_M[3]}]
set_input_delay -clock i_Clk  0  [get_ports {i_M[2]}]
set_input_delay -clock i_Clk  0  [get_ports {i_M[1]}]
set_input_delay -clock i_Clk  0  [get_ports {i_M[0]}]
set_input_delay -clock i_Clk  0  [get_ports {i_alpha[7]}]
set_input_delay -clock i_Clk  0  [get_ports {i_alpha[6]}]
set_input_delay -clock i_Clk  0  [get_ports {i_alpha[5]}]
set_input_delay -clock i_Clk  0  [get_ports {i_alpha[4]}]
set_input_delay -clock i_Clk  0  [get_ports {i_alpha[3]}]
set_input_delay -clock i_Clk  0  [get_ports {i_alpha[2]}]
set_input_delay -clock i_Clk  0  [get_ports {i_alpha[1]}]
set_input_delay -clock i_Clk  0  [get_ports {i_alpha[0]}]
set_input_delay -clock i_Clk  0  [get_ports {i_beta[7]}]
set_input_delay -clock i_Clk  0  [get_ports {i_beta[6]}]
set_input_delay -clock i_Clk  0  [get_ports {i_beta[5]}]
set_input_delay -clock i_Clk  0  [get_ports {i_beta[4]}]
set_input_delay -clock i_Clk  0  [get_ports {i_beta[3]}]
set_input_delay -clock i_Clk  0  [get_ports {i_beta[2]}]
set_input_delay -clock i_Clk  0  [get_ports {i_beta[1]}]
set_input_delay -clock i_Clk  0  [get_ports {i_beta[0]}]
set_input_delay -clock i_Clk  0  [get_ports {i_V_reset[7]}]
set_input_delay -clock i_Clk  0  [get_ports {i_V_reset[6]}]
set_input_delay -clock i_Clk  0  [get_ports {i_V_reset[5]}]
set_input_delay -clock i_Clk  0  [get_ports {i_V_reset[4]}]
set_input_delay -clock i_Clk  0  [get_ports {i_V_reset[3]}]
set_input_delay -clock i_Clk  0  [get_ports {i_V_reset[2]}]
set_input_delay -clock i_Clk  0  [get_ports {i_V_reset[1]}]
set_input_delay -clock i_Clk  0  [get_ports {i_V_reset[0]}]
set_input_delay -clock i_Clk  0  [get_ports i_kappa]
set_input_delay -clock i_Clk  0  [get_ports {i_gamma[1]}]
set_input_delay -clock i_Clk  0  [get_ports {i_gamma[0]}]
set_output_delay -clock i_Clk  0  [get_ports {o_V[7]}]
set_output_delay -clock i_Clk  0  [get_ports {o_V[6]}]
set_output_delay -clock i_Clk  0  [get_ports {o_V[5]}]
set_output_delay -clock i_Clk  0  [get_ports {o_V[4]}]
set_output_delay -clock i_Clk  0  [get_ports {o_V[3]}]
set_output_delay -clock i_Clk  0  [get_ports {o_V[2]}]
set_output_delay -clock i_Clk  0  [get_ports {o_V[1]}]
set_output_delay -clock i_Clk  0  [get_ports {o_V[0]}]
set_output_delay -clock i_Clk  0  [get_ports o_spike]
