###################################################################

# Created by write_sdc on Mon Aug 27 09:34:05 2018

###################################################################
set sdc_version 2.0

set_units -time ns -resistance MOhm -capacitance fF -voltage V -current mA
set_wire_load_model -name 5K_hvratio_1_1 -library NangateOpenCellLibrary
create_clock -name i_clk  -period 4  -waveform {0 2}
set_clock_uncertainty 0.004  [get_clocks i_clk]
set_input_delay -clock i_clk  0  [get_ports {i_syn_weight[31]}]
set_input_delay -clock i_clk  0  [get_ports {i_syn_weight[30]}]
set_input_delay -clock i_clk  0  [get_ports {i_syn_weight[29]}]
set_input_delay -clock i_clk  0  [get_ports {i_syn_weight[28]}]
set_input_delay -clock i_clk  0  [get_ports {i_syn_weight[27]}]
set_input_delay -clock i_clk  0  [get_ports {i_syn_weight[26]}]
set_input_delay -clock i_clk  0  [get_ports {i_syn_weight[25]}]
set_input_delay -clock i_clk  0  [get_ports {i_syn_weight[24]}]
set_input_delay -clock i_clk  0  [get_ports {i_syn_weight[23]}]
set_input_delay -clock i_clk  0  [get_ports {i_syn_weight[22]}]
set_input_delay -clock i_clk  0  [get_ports {i_syn_weight[21]}]
set_input_delay -clock i_clk  0  [get_ports {i_syn_weight[20]}]
set_input_delay -clock i_clk  0  [get_ports {i_syn_weight[19]}]
set_input_delay -clock i_clk  0  [get_ports {i_syn_weight[18]}]
set_input_delay -clock i_clk  0  [get_ports {i_syn_weight[17]}]
set_input_delay -clock i_clk  0  [get_ports {i_syn_weight[16]}]
set_input_delay -clock i_clk  0  [get_ports {i_syn_weight[15]}]
set_input_delay -clock i_clk  0  [get_ports {i_syn_weight[14]}]
set_input_delay -clock i_clk  0  [get_ports {i_syn_weight[13]}]
set_input_delay -clock i_clk  0  [get_ports {i_syn_weight[12]}]
set_input_delay -clock i_clk  0  [get_ports {i_syn_weight[11]}]
set_input_delay -clock i_clk  0  [get_ports {i_syn_weight[10]}]
set_input_delay -clock i_clk  0  [get_ports {i_syn_weight[9]}]
set_input_delay -clock i_clk  0  [get_ports {i_syn_weight[8]}]
set_input_delay -clock i_clk  0  [get_ports {i_syn_weight[7]}]
set_input_delay -clock i_clk  0  [get_ports {i_syn_weight[6]}]
set_input_delay -clock i_clk  0  [get_ports {i_syn_weight[5]}]
set_input_delay -clock i_clk  0  [get_ports {i_syn_weight[4]}]
set_input_delay -clock i_clk  0  [get_ports {i_syn_weight[3]}]
set_input_delay -clock i_clk  0  [get_ports {i_syn_weight[2]}]
set_input_delay -clock i_clk  0  [get_ports {i_syn_weight[1]}]
set_input_delay -clock i_clk  0  [get_ports {i_syn_weight[0]}]
set_input_delay -clock i_clk  0  [get_ports {i_G[1]}]
set_input_delay -clock i_clk  0  [get_ports {i_G[0]}]
set_input_delay -clock i_clk  0  [get_ports {i_syn_prn[7]}]
set_input_delay -clock i_clk  0  [get_ports {i_syn_prn[6]}]
set_input_delay -clock i_clk  0  [get_ports {i_syn_prn[5]}]
set_input_delay -clock i_clk  0  [get_ports {i_syn_prn[4]}]
set_input_delay -clock i_clk  0  [get_ports {i_syn_prn[3]}]
set_input_delay -clock i_clk  0  [get_ports {i_syn_prn[2]}]
set_input_delay -clock i_clk  0  [get_ports {i_syn_prn[1]}]
set_input_delay -clock i_clk  0  [get_ports {i_syn_prn[0]}]
set_input_delay -clock i_clk  0  [get_ports i_mode_sel]
set_output_delay -clock i_clk  0  [get_ports {o_syn_weight[7]}]
set_output_delay -clock i_clk  0  [get_ports {o_syn_weight[6]}]
set_output_delay -clock i_clk  0  [get_ports {o_syn_weight[5]}]
set_output_delay -clock i_clk  0  [get_ports {o_syn_weight[4]}]
set_output_delay -clock i_clk  0  [get_ports {o_syn_weight[3]}]
set_output_delay -clock i_clk  0  [get_ports {o_syn_weight[2]}]
set_output_delay -clock i_clk  0  [get_ports {o_syn_weight[1]}]
set_output_delay -clock i_clk  0  [get_ports {o_syn_weight[0]}]
