###################################################################

# Created by write_sdc on Fri Aug 24 16:08:41 2018

###################################################################
set sdc_version 2.0

set_units -time ns -resistance MOhm -capacitance fF -voltage V -current mA
set_wire_load_model -name 5K_hvratio_1_1 -library NangateOpenCellLibrary
create_clock -name i_clk  -period 4  -waveform {0 2}
set_clock_uncertainty 0.004  [get_clocks i_clk]
set_input_delay -clock i_clk  0  [get_ports i_V_valid]
set_input_delay -clock i_clk  0  [get_ports {i_V[7]}]
set_input_delay -clock i_clk  0  [get_ports {i_V[6]}]
set_input_delay -clock i_clk  0  [get_ports {i_V[5]}]
set_input_delay -clock i_clk  0  [get_ports {i_V[4]}]
set_input_delay -clock i_clk  0  [get_ports {i_V[3]}]
set_input_delay -clock i_clk  0  [get_ports {i_V[2]}]
set_input_delay -clock i_clk  0  [get_ports {i_V[1]}]
set_input_delay -clock i_clk  0  [get_ports {i_V[0]}]
set_input_delay -clock i_clk  0  [get_ports {i_thresh_prn[7]}]
set_input_delay -clock i_clk  0  [get_ports {i_thresh_prn[6]}]
set_input_delay -clock i_clk  0  [get_ports {i_thresh_prn[5]}]
set_input_delay -clock i_clk  0  [get_ports {i_thresh_prn[4]}]
set_input_delay -clock i_clk  0  [get_ports {i_thresh_prn[3]}]
set_input_delay -clock i_clk  0  [get_ports {i_thresh_prn[2]}]
set_input_delay -clock i_clk  0  [get_ports {i_thresh_prn[1]}]
set_input_delay -clock i_clk  0  [get_ports {i_thresh_prn[0]}]
set_input_delay -clock i_clk  0  [get_ports {i_M[7]}]
set_input_delay -clock i_clk  0  [get_ports {i_M[6]}]
set_input_delay -clock i_clk  0  [get_ports {i_M[5]}]
set_input_delay -clock i_clk  0  [get_ports {i_M[4]}]
set_input_delay -clock i_clk  0  [get_ports {i_M[3]}]
set_input_delay -clock i_clk  0  [get_ports {i_M[2]}]
set_input_delay -clock i_clk  0  [get_ports {i_M[1]}]
set_input_delay -clock i_clk  0  [get_ports {i_M[0]}]
set_input_delay -clock i_clk  0  [get_ports {i_alpha[7]}]
set_input_delay -clock i_clk  0  [get_ports {i_alpha[6]}]
set_input_delay -clock i_clk  0  [get_ports {i_alpha[5]}]
set_input_delay -clock i_clk  0  [get_ports {i_alpha[4]}]
set_input_delay -clock i_clk  0  [get_ports {i_alpha[3]}]
set_input_delay -clock i_clk  0  [get_ports {i_alpha[2]}]
set_input_delay -clock i_clk  0  [get_ports {i_alpha[1]}]
set_input_delay -clock i_clk  0  [get_ports {i_alpha[0]}]
set_input_delay -clock i_clk  0  [get_ports {i_beta[7]}]
set_input_delay -clock i_clk  0  [get_ports {i_beta[6]}]
set_input_delay -clock i_clk  0  [get_ports {i_beta[5]}]
set_input_delay -clock i_clk  0  [get_ports {i_beta[4]}]
set_input_delay -clock i_clk  0  [get_ports {i_beta[3]}]
set_input_delay -clock i_clk  0  [get_ports {i_beta[2]}]
set_input_delay -clock i_clk  0  [get_ports {i_beta[1]}]
set_input_delay -clock i_clk  0  [get_ports {i_beta[0]}]
set_input_delay -clock i_clk  0  [get_ports {i_V_reset[7]}]
set_input_delay -clock i_clk  0  [get_ports {i_V_reset[6]}]
set_input_delay -clock i_clk  0  [get_ports {i_V_reset[5]}]
set_input_delay -clock i_clk  0  [get_ports {i_V_reset[4]}]
set_input_delay -clock i_clk  0  [get_ports {i_V_reset[3]}]
set_input_delay -clock i_clk  0  [get_ports {i_V_reset[2]}]
set_input_delay -clock i_clk  0  [get_ports {i_V_reset[1]}]
set_input_delay -clock i_clk  0  [get_ports {i_V_reset[0]}]
set_input_delay -clock i_clk  0  [get_ports i_kappa]
set_input_delay -clock i_clk  0  [get_ports {i_gamma[1]}]
set_input_delay -clock i_clk  0  [get_ports {i_gamma[0]}]
set_output_delay -clock i_clk  0  [get_ports {o_V[7]}]
set_output_delay -clock i_clk  0  [get_ports {o_V[6]}]
set_output_delay -clock i_clk  0  [get_ports {o_V[5]}]
set_output_delay -clock i_clk  0  [get_ports {o_V[4]}]
set_output_delay -clock i_clk  0  [get_ports {o_V[3]}]
set_output_delay -clock i_clk  0  [get_ports {o_V[2]}]
set_output_delay -clock i_clk  0  [get_ports {o_V[1]}]
set_output_delay -clock i_clk  0  [get_ports {o_V[0]}]
set_output_delay -clock i_clk  0  [get_ports o_spike]
